**1. Write a Python program which iterates the integers from 1 to 50. For multiples of 3 print "Fizz" instead of the number and for the multiples of 5 print "Buzz". For numbers which are multiples of both 3 and 5 print "FizzBuzz".**

In [28]:
x=1
while x<=50:
    if(x%3==0 and x%5==0):
        print(x,"\t-\tFizzBuzz")
    elif(x%3==0):
        print(x,"\t-\tFizz")
    elif(x%5==0):
        print(x,"\t-\tBuzz")
    #else:
        #print(x)
    x+=1

3 	-	Fizz
5 	-	Buzz
6 	-	Fizz
9 	-	Fizz
10 	-	Buzz
12 	-	Fizz
15 	-	FizzBuzz
18 	-	Fizz
20 	-	Buzz
21 	-	Fizz
24 	-	Fizz
25 	-	Buzz
27 	-	Fizz
30 	-	FizzBuzz
33 	-	Fizz
35 	-	Buzz
36 	-	Fizz
39 	-	Fizz
40 	-	Buzz
42 	-	Fizz
45 	-	FizzBuzz
48 	-	Fizz
50 	-	Buzz

**2. Write a Python program to count the number of even and odd numbers from a tuple of numbers.**
<br>
numbers=(12,15,3,6,26,33,56,65,78,37,42,99)

In [34]:
numbers=(12,15,3,6,26,33,56,65,78,37,42,99)
even=0
odd=0

for x in numbers:
    if(x%2==0):
        print(x)
        even+=1
print("\n")
for x in numbers:
    if(x%2!=0):
        print(x)
        odd+=1

print("Number of Even Numbers = ",even)
print("Number of Odd  Numbers = ",odd)

12
6
26
56
78
42


15
3
33
65
37
99
Number of Even Numbers =  6
Number of Odd  Numbers =  6

**3. Take 5 integers from keyboard using a loop and print their average value on the screen.**

In [40]:
count=0
list1=[]
for x in range(5):
    value=float(input("Enter a No: "))
    list1.append(value)
    count+=1
print("Average: ",sum(list1)/len(list1))

Enter a No: 2
Enter a No: 3
Enter a No: 4
Enter a No: 5
Enter a No: 6
Average:  4.0

**4. Following are the tuples of students who have enrolled for two courses. Find out those students who have enrolled for both the courses.**
<br>
course_A=('Anuj', 'Katrina', 'John', 'Jessica', 'Michael', 'Rahul', 'Khushboo')
<br>
 course_B=('Bhavana', 'Katrina','Michael', 'Robert', 'Khushboo', 'Sachin' )

In [42]:
course_A=('Anuj', 'Katrina', 'John', 'Jessica', 'Michael', 'Rahul', 'Khushboo')
course_B=('Bhavana', 'Katrina','Michael', 'Robert', 'Khushboo', 'Sachin' )
set_A=set(course_A)
set_B=set(course_B)
print(set_A&set_B)

{'Khushboo', 'Michael', 'Katrina'}

**5. Write a Python function to create and print a list where the values are square of numbers between 1 and 25 (both included).**

In [44]:
def square():
    listA=[]
    for i in range(1,26):
        listA.append(x*x)
    print(listA)
square()

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, 361, 400, 441, 484, 529, 576]

**6. Write a Pandas program to create a Series out of the given list and sort it in the descending order.**
<br>
data_list=['1000', 'spyder', 'python', 'jupyter', '400.78', 'anaconda']

In [48]:
import pandas as pd
data_list=['1000', 'spyder', 'python', 'jupyter', '400.78', 'anaconda']
df=pd.Series(data_list)
df.sort_values(ascending=False)

1      spyder
2      python
3     jupyter
5    anaconda
4      400.78
0        1000
dtype: object

**7. Create a series out of a range of values from 1 to 10. Ask the user to specify how many observations should be displayed and print that many observations from the series.**

In [56]:
list1=[]
for i in range(1,11):
    list1.append(i)
x=int(input("Enter No. of Obs.: "))
print(list1[:x])
#for i in range(0,x):
    #print(list1[i])

Enter No. of Obs.: 7
[1, 2, 3, 4, 5, 6, 7]

**8. Write a Pandas program to create the mean and standard deviation of the data of a given Series.**
<br>
data_list = [1,2,3,4,5,6,7,8,9,5,3]

In [57]:
import pandas as pd
data_list = [1,2,3,4,5,6,7,8,9,5,3]
s=pd.Series(data_list)
print(s.mean())
print(s.std())

4.818181818181818
2.522624895547565

**9. Write a Pandas program to display a summary of the basic information about the DataFrame and its data.**
<br>
exam_data = {'name': ['Anuj', 'Bhavana', 'Katrina', 'John', 'Jessica', 'Michael', 'Robert', 'Rahul', 'Khushboo', 'Sachin'],
'score': [12.5, 9, 16.5, 8, 9, 20, 14.5, 5, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
<br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [59]:
exam_data = {'name': ['Anuj', 'Bhavana', 'Katrina', 'John', 'Jessica', 'Michael', 'Robert', 'Rahul', 'Khushboo', 'Sachin'], 
             'score': [12.5, 9, 16.5, 8, 9, 20, 14.5, 5, 8, 19], 
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
exam_df=pd.DataFrame(exam_data,index=labels)

       name  score  attempts qualify
a      Anuj   12.5         1     yes
b   Bhavana    9.0         3      no
c   Katrina   16.5         2     yes
d      John    8.0         3      no
e   Jessica    9.0         2      no
f   Michael   20.0         3     yes
g    Robert   14.5         1     yes
h     Rahul    5.0         1      no
i  Khushboo    8.0         2      no
j    Sachin   19.0         1     yes

**10. Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the above data frame.**

In [62]:
exam_data = {'name': ['Anuj', 'Bhavana', 'Katrina', 'John', 'Jessica', 'Michael', 'Robert', 'Rahul', 'Khushboo', 'Sachin'], 
             'score': [12.5, 9, 16.5, 8, 9, 20, 14.5, 5, 8, 19], 
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
exam_df=pd.DataFrame(exam_data,index=labels)
exam_df.loc[["a","c","e","f"],["name","score"]]

      name  score
a     Anuj   12.5
c  Katrina   16.5
e  Jessica    9.0
f  Michael   20.0

**11. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2 and still did not qualify.**

In [64]:
exam_data = {'name': ['Anuj', 'Bhavana', 'Katrina', 'John', 'Jessica', 'Michael', 'Robert', 'Rahul', 'Khushboo', 'Sachin'], 
             'score': [12.5, 9, 16.5, 8, 9, 20, 14.5, 5, 8, 19], 
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
exam_df=pd.DataFrame(exam_data,index=labels)
exam_df[(exam_df["attempts"]>2)&(exam_df["qualify"]=="no")]

      name  score  attempts qualify
b  Bhavana    9.0         3      no
d     John    8.0         3      no

**12. Write a Pandas program to change the score in row 'd' to 11.5.**

In [67]:
exam_data = {'name': ['Anuj', 'Bhavana', 'Katrina', 'John', 'Jessica', 'Michael', 'Robert', 'Rahul', 'Khushboo', 'Sachin'], 
             'score': [12.5, 9, 16.5, 8, 9, 20, 14.5, 5, 8, 19], 
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
exam_df=pd.DataFrame(exam_data,index=labels)
exam_df=exam_df.set_value("d","score",11.5)
exam_df

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  import sys

       name  score  attempts qualify
a      Anuj   12.5         1     yes
b   Bhavana    9.0         3      no
c   Katrina   16.5         2     yes
d      John   11.5         3      no
e   Jessica    9.0         2      no
f   Michael   20.0         3     yes
g    Robert   14.5         1     yes
h     Rahul    5.0         1      no
i  Khushboo    8.0         2      no
j    Sachin   19.0         1     yes

**13. Write a Pandas program to change the name 'Jessica' to 'Suresh' in name column of the DataFrame.**

In [69]:
exam_data = {'name': ['Anuj', 'Bhavana', 'Katrina', 'John', 'Jessica', 'Michael', 'Robert', 'Rahul', 'Khushboo', 'Sachin'], 
             'score': [12.5, 9, 16.5, 8, 9, 20, 14.5, 5, 8, 19], 
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
exam_df=pd.DataFrame(exam_data,index=labels)
exam_df.loc[exam_df["name"]=="Jessica","name"]="Suresh"
exam_df

       name  score  attempts qualify
a      Anuj   12.5         1     yes
b   Bhavana    9.0         3      no
c   Katrina   16.5         2     yes
d      John    8.0         3      no
e    Suresh    9.0         2      no
f   Michael   20.0         3     yes
g    Robert   14.5         1     yes
h     Rahul    5.0         1      no
i  Khushboo    8.0         2      no
j    Sachin   19.0         1     yes

**14. Write a Pandas program to delete the 'attempts' column from the DataFrame.**

In [72]:
exam_data = {'name': ['Anuj', 'Bhavana', 'Katrina', 'John', 'Jessica', 'Michael', 'Robert', 'Rahul', 'Khushboo', 'Sachin'], 
             'score': [12.5, 9, 16.5, 8, 9, 20, 14.5, 5, 8, 19], 
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
exam_df=pd.DataFrame(exam_data,index=labels)
exam_df=exam_df.drop("attempts",axis=1)
exam_df

       name  score qualify
a      Anuj   12.5     yes
b   Bhavana    9.0      no
c   Katrina   16.5     yes
d      John    8.0      no
e   Jessica    9.0      no
f   Michael   20.0     yes
g    Robert   14.5     yes
h     Rahul    5.0      no
i  Khushboo    8.0      no
j    Sachin   19.0     yes

**15. Write a Pandas program to rearrange the columns of the dataframe. Follow the order:**
<br>
Qualify, Name, Score

In [74]:
exam_df=exam_df[["qualify","name","score"]]
exam_df

  qualify      name  score
a     yes      Anuj   12.5
b      no   Bhavana    9.0
c     yes   Katrina   16.5
d      no      John    8.0
e      no   Jessica    9.0
f     yes   Michael   20.0
g     yes    Robert   14.5
h      no     Rahul    5.0
i      no  Khushboo    8.0
j     yes    Sachin   19.0